Repository: TabMe-Co/tabme-app-localizations
Catalog: lib/l10n/app_*.arb
Languages: el

source: Welcome back,
el: Καλώς ήρθες,

source: You owe
el: Χρωστάς

source: You receive
el: Λαμβάνεις

source: Nothing to see here
el: Δεν υπάρχει τίποτα να δεις εδώ

source: Join
el: Συμμετοχή

source: Create tab
el: Δημιουργία

source: Sign out
el: Έξοδος

source: Sign in
el: Σύνδεση

# sloganBadge1
source: Split the bill
el: Λογαριασμό

# sloganWord1
source: like
el: παιχνίδι

# sloganWord2
source: a
el: και

# sloganWord3
source: pro
el: γίνε

# sloganWord4
source: and
el: ο

# sloganBadge2
source: hero
el: Ήρωας

# sloganWord7
source: at
el: του

# sloganWord8
source: the
el: τραπεζιού!

source: Get started!
el: Ξεκίνησε!
